[
  {
    "URLPuesto": "https://hireline.io/remoto/empleos/ruby-backend-developer-middle-remoto/111788",
    "titulo": "Ruby Backend Developer Middle – Remoto en HIRELINE",
    "sueldo": "Sueldo oculto",
    "ubicacionLimpia": "Remoto: LATAM",
    "tiempo": "Empleado de tiempo completo",
    "ingles": "Inglés : Nivel Básico",
    "descripcionLimpia": "Estamos buscando un Desarrollador a Tiempo Completo para unirse a nuestro equipo. Alguien con experiencia y un sólido conocimiento en frameworks MVC (Ruby on Rails principalmente). Lo que buscamos Disponibilidad a tiempo completo. Amplia experiencia con: Frameworks MVC (Ruby on Rails) (requerido). PHP, Ruby, NodeJS, Vue (preferido). Conocimiento profundo de LEMP (Linux, Nginx, MySQL, PHP). Familiaridad con sistemas de Inteligencia Artificial, incluyendo LLMs (Modelos de Lenguaje Extensos), y su integración en aplicaciones. Experiencia usando herramientas de automatización como n8n, make, zapier. Experiencia usando Docker / contenedores. Puntos extra Si has ganado becas, competencias o recibido reconocimientos profesionales/académicos. Experiencia en diseño, despliegue y mantenimiento de aplicaciones web. Dominio del inglés (lectura y escritura). Responsabilidades Diseño, desarrollo y pruebas de aplicaciones web. Instalación, despliegue y soporte de aplicaciones en servidores virtuales. Colaborar en reuniones de equipo para definir, priorizar y refinar funcionalidades. Estimar y reportar el tiempo de desarrollo y la complejidad de las tareas asignadas. Aprovechar la IA y los LLMs para optimizar flujos de trabajo y mejorar aplicaciones. Desarrollar experiencia en Linux, redes, seguridad, aplicaciones en tiempo real e infraestructura de telecomunicaciones en Norteamérica. Lo que ofrecemos Un rol dentro de un equipo dinámico, colaborativo y con visión de futuro. Oportunidades para trabajar con tecnologías de punta, incluyendo IA/LLMs. Desafíos complejos que te harán crecer profesional y técnicamente. La oportunidad de liderar el desarrollo de soluciones impactantes en un entorno ágil y acelerado. ."
  },
  {
    "URLPuesto": "https://hireline.io/remoto/empleos/software-engineer-ruby-on-rails-javascript-senior-remoto/111232",
    "titulo": "Software Engineer (Ruby on Rails, JavaScript) - Senior - Remoto en Alcor",
    "sueldo": "$ 80,000 a 90,000 MXN (Bruto)",
    "ubicacionLimpia": "Remoto: México",
    "tiempo": "Empleado de tiempo completo",
    "ingles": "Inglés : Nivel Intermedio",
    "descripcionLimpia": "About the job Software Engineer (RoR, Javascript) Software Engineer (RoR, Javascript) About the Role As a Software Engineer, you'll join our dynamic Technology Team. You'll play a critical role in every step of the software development life cycle, working closely with others to brainstorm and build solutions to support the school districts with whom we partner. In this role, you'll work collaboratively and efficiently and build skills across technology, including AI. The team has strong technical chops, and we value learning and challenging ourselves. From guest talks, internal demos, knowledge sharing spaces, book clubs, hackathons, and open-source projects, we try to improve ourselves as we help schools worldwide do the same. Responsibilities: Work on fascinating and challenging engineering challenges, like: building out real-time data pipelines of a students important day-to-day events into our platform, including the quantifiable and qualitative elements of a students experience designing a highly available online platform that calculates real time analytics across billions data points refining our products user experience so that this firehose of data is truly useful, actionable information (as opposed to yet another data dashboard) integrating the latest educational research and data science tools into our platform, so that our clients have access to the best techniques that they can use to change outcomes for students Design, prototype, write, test, review, debug, deploy, monitor, and occasionally be frustrated by code. Teach other engineers the tools, tricks, and techniques youve become proficient in, and be open to learning and being challenged by your teammates to learn more. Our Ideal Candidate Has: 4+ years of full-time, professional web app development experience. You've seen your products launch to great success as well as spectacular failure, and you've learned lessons from both. Proficiency with  Ruby  on Rails, Vue.js & JavaScript Experience with Docker Database experience with Postgres Skill in maintaining and troubleshooting existing web applications Strong verbal and written communication skills A track record of being highly collaborative, accountable, and reliable Interest and enthusiasm for AI technologies Bonus Points: Expertise in AI development Knowledge of Terraform and Cloudformation (a plus) Experience with Datadog Security Engineering experience"
  },
  {
    "URLPuesto": "https://hireline.io/remoto/empleos/sr-software-engineer-full-stack-remoto/111429",
    "titulo": "Sr. Software Engineer (Full Stack) - Remoto",
    "sueldo": "Sueldo oculto",
    "ubicacionLimpia": "Remoto: México",
    "tiempo": "Empleado de tiempo completo",
    "ingles": "Inglés : Nivel Avanzado",
    "descripcionLimpia": "¡Se busca a Sr. Full Stack Developer!  Importante empresa del sector requiere un Sr. Full Stack Developer con experiencia en desarrollo de aplicaciones web con Ruby on Rails, Lenguaje Ruby, Javascript, HTML, CSS Conocimiento en procesos AGILE, o Scrum,  si tiene experiencia en entornos Linux es un plus. Actividades: Colaborar con gerentes de producto y diseñadores para crear soluciones de software que atiendan necesidades clave de clientes y objetivos del negocio. Liderar la implementación end-to-end: desde estimación de esfuerzo y planificación de sprints hasta la ejecución técnica. Garantizar la excelencia del producto mediante:  -  Pruebas unitarias rigurosas (TDD/BDD cuando aplica)  -  Cumplimiento de principios SOLID y estándares de código limpio  -  Optimización de rendimiento y reducción de deuda técnica  Competencias: Gran capacidad de comunicación, se necesita alguien que le guste opinar.  Sueldo: Entre 90k y 120k mensuales, pago por honorarios, no prestaciones Idioma: Inglés Avanzado Lugar de trabajo: De preferencia que viva en Zapopan, Jalisco, pero puede ser trabajo 100% remoto en cualquier parte de la república.  Haber trabajado en empresas de desarrollo de algún producto que se comercialice"
  },
  {
    "URLPuesto": "https://hireline.io/remoto/empleos/senior-software-engineer-aws-remoto/110998",
    "titulo": "Senior Software Engineer (AWS) - Remoto en Caylent",
    "sueldo": "Sueldo oculto",
    "ubicacionLimpia": "Remoto: México",
    "tiempo": "Empleado de tiempo completo",
    "ingles": "Inglés : Nivel Intermedio",
    "descripcionLimpia": "The Mission We are seeking a talented Senior Software Engineer to join our growing Cloud Native Applications team. The right candidate is someone who has a deep understanding of building applications in the cloud and utilizing cloud native services to make applications more reliable and scalable. Your mission will be to develop applications and services using cloud native technologies for our customers.   Your Assignment You will be a mission specialist, rocketing Customers forward as you participate in development activities, standups, sprint planning retrospectives, and more. You will demonstrate Caylent's commitment to being an Exceptional Partner by delivering well-documented, tested, and production-ready code to our customers while diving deep into any problems that may arise across their environments. You will Lead By Example, using your expertise in AWS Services and API development to deliver solutions defined by your Architect, and coach less-experienced developers as your team builds together. You will demonstrate a passion to Stay Curious as you mentor peers, tackle new technologies, and learn from our word-class team of engineers.   Your Qualifications Expertise in underlying web technologies like HTML and CSS, and experience developing with a framework like React, Vue, Angular, MVC .Net, etc. Experience with modern server-side scripting languages (python, node.js, php, ruby, etc.). In-depth knowledge of relational databases (PostgreSQL, MySQL, etc), NoSQL databases (MongoDB, DynamoDB, etc), and object stores (S3, etc). Demonstrated experience in building RESTful services and API integrations. Development experience on a major cloud platform (Azure, AWS, or GCP). Understanding of modern application architectures (event driven, message queues, microservices, etc). Proven ability to learn new technology quickly and effectively.  Desire to integrate innovative technologies into development workflow. Familiarity with Generative AI technologies. Self organizing, detail oriented, and high achieving. Ability to work independently. Excellent written and verbal communication.   Preferred Qualifications BS in a computing-related field, or commensurate experience. Experience with testing and automation. Experience with UI/UX. Experience with Large Language Models (LLM) and Generative AI. Experience with app dev acceleration tools like Amazon Q Developer, GitHub CoPilot, Cursor.AI, or similar. Experience building and maintaining CI/CD pipelines. Experience configuring AWS resources. Experience with infrastructure as code tooling (SAM, Cloudformation, Terraform, etc).   Benefits 100% remote work Medical Insurance for you and eligible dependents Generous holidays and flexible PTO Competitive phantom equity Paid for exams and certifications Peer bonus awards State of the art laptop and tools Equipment & Office Stipend Individual professional development plan Annual stipend for Learning and Development Work with an amazing worldwide team and in an incredible corporate culture Kindly submit your resume in English, as it’s required for this role. Caylent is a place where everyone belongs.  We celebrate diversity and are committed to creating an inclusive environment for all employees. Our approach helps us to build a winning team that represents a variety of backgrounds, perspectives, and abilities. So, regardless of how your diversity expresses itself, you can find a home here at Caylent.    We are proud to be an equal opportunity employer. We prohibit discrimination and harassment of any kind based on race, color, religion, national origin, sex (including pregnancy), sexual orientation, gender identity, gender expression, age, veteran status, genetic information, disability, or other applicable legally protected characteristics. If you would like to request an accommodation due to a disability, please contact us."
  },
  {
    "URLPuesto": "https://hireline.io/remoto/empleos/full-stack-senior-engineer/111567",
    "titulo": "Full-Stack Senior Engineer en HIRELINE",
    "sueldo": "Sueldo oculto",
    "ubicacionLimpia": "Remoto: LATAM",
    "tiempo": "Empleado de tiempo completo",
    "ingles": "Inglés : No se ha especificado",
    "descripcionLimpia": "Título: Fullstack Developer Company Overview A market-leading healthcare workforce optimization software provider dedicated to streamlining and optimizing healthcare organizations' workforce management processes. Our cutting-edge technology empowers healthcare providers to enhance patient care, optimize staff resources, and improve operational efficiency.   Shape the future of our web platform! We are seeking a highly experienced Full-Stack Senior Engineer to lead the design, development, and optimization of our cutting-edge healthcare workforce management platform. You'll leverage your in-depth knowledge of both front-end and back-end development to build a user-centric, scalable, and performant web application. While we primarily use Elixir (with Phoenix and Ecto), we prioritize general problem-solving skills and a strong commitment to learning new technologies.   Responsibilities: ● Architect and implement scalable and secure back-end systems that power the web application. ● Design and develop user interfaces that are intuitive, user-friendly, and responsive across all devices. ● Collaborate with designers to translate user stories and wireframes into functional web components. ● Lead the optimization of web application performance and user experience, ensuring   fast load times and a smooth user journey. ● Write clean, maintainable, and well-documented code for both front-end and back-end components. ● Stay up-to-date on the latest web development trends and technologies. ● Mentor and guide junior developers on the team. (in the future)   Requirements: ● Advanced English skills ● 10+ years of experience in full-stack web development with a strong emphasis on front-end development. ● Proficiency in modern programming languages including: ○ Front-End: HTML, CSS, JavaScript (ES6+), Experience with a popular front-end framework (e.g., React, Angular). LiveView (Elixir/Phoenix) is a bonus. ○ Back-End: ■ Preferred: Python, Java, Ruby on Rails, Go, Node.js (with Express.js) ■ Ideal experience: Elixir (with Phoenix) ● Experience with building responsive web applications. ● Strong understanding of web development best practices, including accessibility and performance optimization ● Excellent problem-solving and analytical skills. ● Strong communication and collaboration skills.   Preferred Qualifications: ● Bachelor's degree in Computer Science, Engineering, or related field. ● Experience building modern SaaS applications, including user management, authentication, and authorization functionalities. ● Experience with integrating front-end applications with back-end services ● Experience with cloud platforms (e.g., AWS, Azure, Google Cloud) for deploying and scaling SaaS applications. ● Experience with accessibility best practices (WCAG). ● Experience working in a fast-paced, start-up environment.   Don't miss the opportunity to be part of our team! Apply now and join us on this exciting adventure!  ."
  },
  {
    "URLPuesto": "https://hireline.io/remoto/empleos/desarrollador-sap-abap-sap-fi-remoto/111046",
    "titulo": "Desarrollador SAP ABAP - SAP FI - Remoto en Capital Empresarial Horizonte",
    "sueldo": "$ 60,000 a 70,000 MXN (Bruto)",
    "ubicacionLimpia": "Remoto: México",
    "tiempo": "Empleado de tiempo completo",
    "ingles": "Inglés : Nivel Intermedio",
    "descripcionLimpia": "Capital Empresarial Horizonte Empresa Mexicana especialista en Recursos Humanos y Tecnologías de la Información solicita:   Desarrollador SAP ABAP - SAP FI Ingles conversacional obligatorio 100% remoto Calificaciones Habilidades Técnicas Experiencia como Desarrollador ABAP o Desarrollador Senior, con mínimo 5 años de experiencia práctica en desarrollo core SAP ABAP y/o experiencia con SAP Fiori UI5. Sólido conocimiento del diseño SAP enfocado en Finanzas, incluyendo flujos de proceso relacionados con: Asientos contables basados en cuentas de mayor (GL) Creación y contabilización de facturas Procesos de Cuentas por Pagar y Cuentas por Cobrar Reconocimiento de ingresos Uso de user-exits y sustituciones Conocimiento de estructuras de tablas y campos subyacentes en SAP FI sobre S/4 HANA . Familiaridad con APIs, BAPIs y módulos de función comunes en el área financiera, relacionados con contabilizaciones financieras, cálculo de divisas, determinación de impuestos, ejecuciones de pago, estados de cuenta bancarios, etc. Experiencia en iniciativas de migración a S/4 HANA y exposición al modelo de programación RAP (side-by-side) e integración con BTP . Capacidad para elaborar diseños técnicos de alto nivel y proponer buenas prácticas alineadas con principios de Clean Core . Dominio del uso de: BADI’s, BAPI’s, LSMW, ALE, llamadas RFC, IDOC, BDC, objetos de negocio, clases y métodos, Adobe Forms, SmartForms, SAPScripts, Diccionario de Datos y ALV. Fuertes habilidades en depuración ABAP. Ofrecemos: •      Salario 100% nominal • Seguro de Gastos Médicos Mayores más Póliza de exceso ilimitado.  • Seguro dental y visual.  • Seguro de Vida. • Todas las prestaciones legales desde el primer año. •    Prima vacacional del 50% • Aguinaldo a 24 días.  •    Vales de despensa por $3300,53  •    Apoyo monetario en caso de que trabajes desde Home Office. Si te encuentras interesado, manda tu CV a:         contacto (arroba) horizonteempresarial.com.mx"
  }
]